{"id":10778,"date":"2020-03-15T14:27:12","date_gmt":"2020-03-15T14:27:12","guid":{"rendered":"\/blog\/?p=10778"},"modified":"2020-03-15T14:28:07","modified_gmt":"2020-03-15T14:28:07","slug":"is-the-coronavirus-disease-covid-19-affecting-your-business","status":"publish","type":"post","link":"\/blog\/is-the-coronavirus-disease-covid-19-affecting-your-business\/","title":{"rendered":"Is The Coronavirus Disease (Covid-19) Affecting Your Business?"},"content":{"rendered":"<p>The novel Coronavirus, also called SARS-CoV-2, that started in the industrial city of Wuhan in China in December 2019, has not only spread across China like a fire but has now touched the other parts of the world too – primarily Europe, East Asia, the Middle East and also the US. These are places where millions travel, day in and out, for business, leisure and for economic reasons. As the disease spreads and with no scientific or medical cure yet on the scene, Covid-19 is looking to disrupt business and commercial functionalities with a probable negative impact on the global economy.<\/p>\n<p>As per a report published by McKinsey, it is being said that the global GDP growth rate that was estimated to be about 2.5% for 2020 is likely to go down to 2.0%. The probable effects of the spread of the Coronavirus are being estimated to last till the first quarter of the next financial year (2020-21) with GDP growth rates of China, East Asia, Middle East and the other economies expected to slow down in Q1. The report also goes onto say that by Q2, things would start to get back to normal in most parts of the world through the consumer market may take time to strengthen up again.<\/p>\n<h2>Impact of COVID-19 so far<\/h2>\n<p>WHO has now gone ahead and declared Coronavirus as a pandemic and Europe to be the epicenter of the virus for now!<\/p>\n<p>With the closure of shopping malls, cinema halls, public events, sporting events, and all kinds of mass gatherings and public notifications being issued in most countries to stay indoors and away from public places; this disease is surely going to affect many small, medium and big businesses. Some of the industries that are going to be badly hit by the virus are the airlines, travel, tourism, hotels, and other such service sector entities. Business entities that have been dealing with China-made products will face a maximum challenge. In the consumer industry too, there is going to be a steep drop in consumer demands, especially in the luxury segment goods. Sellers of daily need products still do not have much reason to worry though.<\/p>\n<h2>Google – Is the Coronavirus affecting your business?<\/h2>\n<p>However, for the online world, the story might be a bit different. As the scope of physical contact in the case of e-commerce is minimal, businesses that are active on the online medium may not feel the impact as strongly as their counterparts in the physical world.<\/p>\n<p>Whether business owners are selling online or are just using their online presence to enhance branding, Google has got active in the last few days and sending out emails to business and website owners wanting to know if the Coronavirus has affected their business or not! The emails are being sent through Google My Business. It is Google’s way of serving the online community better as the response of business owners will help their customers understand if there has been any changes in the business hours or business description or Google posts or the phone number of the business and accordingly adjust their dealing with the business entities.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The novel Coronavirus, also called SARS-CoV-2, that started in the industrial city of Wuhan in China in December 2019, has not only spread across China like a fire but has now touched the other parts of the world too – primarily Europe, East Asia, the Middle East and also the US. These are places where [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":10779,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[131],"tags":[],"class_list":["post-10778","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-advice"],"_links":{"self":[{"href":"\/blog\/wp-json\/wp\/v2\/posts\/10778"}],"collection":[{"href":"\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/comments?post=10778"}],"version-history":[{"count":0,"href":"\/blog\/wp-json\/wp\/v2\/posts\/10778\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/media\/10779"}],"wp:attachment":[{"href":"\/blog\/wp-json\/wp\/v2\/media?parent=10778"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/categories?post=10778"},{"taxonomy":"post_tag","embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/tags?post=10778"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}