{"id":3675,"date":"2016-04-29T05:16:17","date_gmt":"2016-04-29T05:16:17","guid":{"rendered":"https:\/\/ezrankings.org\/blog\/?p=3675"},"modified":"2019-02-25T11:27:10","modified_gmt":"2019-02-25T11:27:10","slug":"googles-digital-library","status":"publish","type":"post","link":"\/blog\/googles-digital-library\/","title":{"rendered":"Google&#8217;s Digital Library"},"content":{"rendered":"<p align=\"justify\">As one of the leading global networks, Google has always stayed ahead of the growth curve. Since its inception, the company worked hard towards making global information highly accessible to users across the world.<\/p>\n<p align=\"justify\">However, the foundation for this widespread information-sharing began much earlier. Sergey and Larey conceptualized Google Books, providing access to crucial information to users. As the most popular network as well as a leading search engine, Google always believes in the concept of quality content.<\/p>\n<p align=\"justify\">The company believes that access to high-quality content happens to be the prerequisite for gathering information. And what better than Google’s digital library can ensure that.<\/p>\n<h2 align=\"justify\"><strong>Announcing Google’s book search<\/strong><\/h2>\n<p align=\"justify\">It was four years back when the company made the first announcement about Google’s Book Search. Since the day of its launch, Book Search has been highly beneficial for readers across the globe.<\/p>\n<p align=\"justify\">With the help of Book Search, readers not only have the opportunity to read their favorite topics but also have the liberty to choose their linguistic preferences. Google offers books, contents, and reading materials in almost 100 different languages on diverse topics, ranging from physics to history.<\/p>\n<p align=\"justify\">And it has not only helped readers or book purchasers but also improved experiences of publishers. If statistical reports are anything to go by, then close to 20,000 publishers are currently significant parts of Google’s Partner Program.<\/p>\n<p align=\"justify\">With the help of Book Search, publishers have the opportunity of offering book- previews to their readers.<\/p>\n<h2><strong>Translating dreams into reality<\/strong><\/h2>\n<p align=\"justify\">Larry and Sergey’s dream got translated into reality with partnership programs by Google. The company announces partnerships with a large group of publishers, authors, as well as library partners. And this agreement will prove to be beneficial in the following ways.<\/p>\n<ul class=\"listing\">\n<li><strong>Unrestricted reader access:<\/strong> The agreement will inevitably bring good news to readers across the globe. They will have the golden opportunity to access millions of copyrighted books and materials.<\/li>\n<li><strong>New markets for publishers:<\/strong> Publishers and authors will have a brand new market for showcasing their talent and selling their creative works.<\/li>\n<li><strong>Preservation of books and materials:<\/strong> The following agreement will also help Google’s library partners preserve their works, thus making them more accessible to readers, researchers, students, and enthusiasts.<\/li>\n<\/ul>\n<h2><strong>The legal issue<\/strong><\/h2>\n<p align=\"justify\">As stated earlier, the agreement inevitably proves to be beneficial in numerous ways for the company. Apart from popularizing global information sharing, this agreement also played a pivotal role in resolving Google’s legal battles. Let’s go for a quick flashback.<\/p>\n<p align=\"justify\">The year 2005 witnessed a massive uproar in the virtual arena, as the Authors Guild and Association of American Publishers or AAP slammed lawsuits against the largest global network.<\/p>\n<p align=\"justify\">With the help of this agreement, there will be fewer occasions of copyright infringements. As the desired consequence, users will gain uninhibited access to high-quality contents and authors will get proper remunerations for their works.<\/p>\n<p align=\"justify\">Till date, Google has successfully featured approximately 7-million books through Google Book Search. And that offers umpteen opportunities to the <strong><a href=\"https:\/\/www.ezrankings.com\/seo-company-india.html\">best SEO Company in India<\/a><\/strong>, for rethinking and redesigning their <a href=\"https:\/\/www.ezrankings.com\/seo-packages.html\"><strong>SEO Plans<\/strong> <\/a>and strategies.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As one of the leading global networks, Google has always stayed ahead of the growth curve. Since its inception, the company worked hard towards making global information highly accessible to users across the world. However, the foundation for this widespread information-sharing began much earlier. Sergey and Larey conceptualized Google Books, providing access to crucial information [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3803,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[16],"tags":[],"class_list":["post-3675","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-technology"],"_links":{"self":[{"href":"\/blog\/wp-json\/wp\/v2\/posts\/3675"}],"collection":[{"href":"\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/comments?post=3675"}],"version-history":[{"count":0,"href":"\/blog\/wp-json\/wp\/v2\/posts\/3675\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/media\/3803"}],"wp:attachment":[{"href":"\/blog\/wp-json\/wp\/v2\/media?parent=3675"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/categories?post=3675"},{"taxonomy":"post_tag","embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/tags?post=3675"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}