{"id":3702,"date":"2016-04-21T05:33:06","date_gmt":"2016-04-21T05:33:06","guid":{"rendered":"https:\/\/ezrankings.org\/blog\/?p=3702"},"modified":"2021-09-07T09:26:47","modified_gmt":"2021-09-07T09:26:47","slug":"media-websites-battle-for-ad-revenue-and-traffic","status":"publish","type":"post","link":"\/blog\/media-websites-battle-for-ad-revenue-and-traffic\/","title":{"rendered":"Media Websites Battle For Ad Revenue And Traffic"},"content":{"rendered":"<p align=\"justify\">Recent trends in the digital landscape herald tough times ahead. However, the situation has reached a vulnerable point in the past few days. With some of the key online players lowering their profit targets, and even cutting down on human resources, the situation seems to be quite severe. Let’s take a look at the news first.<\/p>\n<p align=\"justify\">Mashable, one of the leading players in the online arena, laid off 30 employees this month. The news came at a time when Mashable successfully raised $15 million as revenue.<\/p>\n<p align=\"justify\">Another mentionable name here is that of Salon. Quite recently, this leading web publishing platform announced a new range of layoffs and budget reductions.<\/p>\n<p align=\"justify\">We must also not forget Buzzfeed, which was initially considered as a success story, is now forcefully led towards dodging questions on revenue.<\/p>\n<p align=\"justify\">Such steps taken by these leading online players speak enough about the dangerous times ahead. Web publishers are constantly thinking about the ways to make money. Revenue generation seems to be an issue, which led web publishers to search for the cause.<\/p>\n<h2><strong>Unraveling the Cause<\/strong><\/h2>\n<p align=\"justify\"><em><strong>According to web publishers, the major problem is two-fold.<\/strong><\/em><\/p>\n<ul class=\"listing\">\n<li>Firstly, it is the unpredictability of online web publishing that makes it a seemingly treacherous affair.<\/li>\n<li>Secondly, website traffic has come across hard times after a decade of buoyant growth.<\/li>\n<\/ul>\n<p align=\"justify\">From ad-blocking tools to automated advertising technology, digital marketers have faced numerous challenges over these years. However, the present situation is not equivalent to those times. Something greater, deeper, and more intense has surfaced.<\/p>\n<p align=\"justify\">So, what is it that’s causing such upheavals?<\/p>\n<h2><strong>Identifying the Probable Reasons<\/strong><\/h2>\n<p align=\"justify\">The rapid proliferation of tech innovations and Internet of Things is responsible for a massive shift in the online advertising arena. The virtual platform is no longer restricted to the web. Mobile innovations gained grounds, and there has been a considerable shift in this context too.<\/p>\n<p align=\"justify\">Another potential reason is the emergence of <a href=\"https:\/\/www.ezrankings.com\/social-media-marketing-services.html\"><strong>social media<\/strong><\/a> platforms. The Social media revolution is no longer on its way. It is already here to stay.<\/p>\n<p align=\"justify\">Other than these aspects, we simply cannot ignore the role of audiences in this battle. Check out the turn of events at a glance:<\/p>\n<ul class=\"listing\">\n<li>Potential audiences like to stay away from website home pages. Rather they prefer to refresh social apps and feeds.<\/li>\n<li>With the ever-increasing social media channels and networks, website visits became unnecessary, thus making life even tougher for site owners.<\/li>\n<li>Media companies failed miserably when it boiled down to explaining the benefits of ad purchases. The entire clientele moved towards social media channels leading to weakened website traffic.<\/li>\n<\/ul>\n<h2><strong>How is Facebook Venturing Out?<\/strong><\/h2>\n<p align=\"justify\">With Facebook devising a 10-year business expansion plan, things are not going to get easier for web-driven businesses and owners. The global platform wishes to launch ‘<strong><a href=\"\/blog\/facebook-instant-articles-are-we-ready-for-it\/\">Instant Articles<\/a><\/strong>’ all over again. As the result, publishers will get the opportunity of publishing their contents directly on the platform.<\/p>\n<p align=\"justify\">Especially with Parse.ly earning more than 40% of its traffic from Facebook, the message is quite clear.<\/p>\n<p align=\"justify\">We can just keep our fingers crossed and see what future has in store for media website owners.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Recent trends in the digital landscape herald tough times ahead. However, the situation has reached a vulnerable point in the past few days. With some of the key online players lowering their profit targets, and even cutting down on human resources, the situation seems to be quite severe. Let’s take a look at the news [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3816,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[18],"tags":[],"class_list":["post-3702","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-news"],"_links":{"self":[{"href":"\/blog\/wp-json\/wp\/v2\/posts\/3702"}],"collection":[{"href":"\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/comments?post=3702"}],"version-history":[{"count":0,"href":"\/blog\/wp-json\/wp\/v2\/posts\/3702\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/media\/3816"}],"wp:attachment":[{"href":"\/blog\/wp-json\/wp\/v2\/media?parent=3702"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/categories?post=3702"},{"taxonomy":"post_tag","embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/tags?post=3702"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}