{"id":3752,"date":"2016-04-08T07:15:37","date_gmt":"2016-04-08T07:15:37","guid":{"rendered":"https:\/\/ezrankings.org\/blog\/?p=3752"},"modified":"2016-04-08T07:15:37","modified_gmt":"2016-04-08T07:15:37","slug":"impersonating-someone-account-in-facebook-may-not-possible-in-future","status":"publish","type":"post","link":"\/blog\/impersonating-someone-account-in-facebook-may-not-possible-in-future\/","title":{"rendered":"Impersonating Someone Account in Facebook May Not Possible In Future"},"content":{"rendered":"<p align=\"justify\">Whether it is Facebook, Twitter or other social media platforms, you simply cannot deny the importance and need for robust security. Although these sites are experimenting, testing and introducing amazing features each new day, not all of them seem to have practical utility for users.<\/p>\n<p align=\"justify\">However, its latest offering might prove to be highly beneficial for users. According to market reports, Facebook is performing tests on an alert feature that will automatically notify you if there are impersonations on your account. In case of an imposter using your profile photo and name, Facebook will immediately identify it and send you notifications about it.<\/p>\n<p align=\"justify\">So, let us find out how it works.<\/p>\n<h2><strong>How will it help?<\/strong><\/h2>\n<p align=\"justify\">With this new testing feature, Facebook will detect any other profile matching to your Facebook profile. As the result, you will find out whether the identified profile is truly an imposter or a genuine Facebook account.<\/p>\n<p align=\"justify\">The testing feature includes automation as well as a human support system, equipped with dedicated support teams. Facebook is reviewing the performance of this particular feature since November and has already introduced it to most of the world. Further expansions are on cards and Facebook will be rolling it out to other parts of the world as well.<\/p>\n<h2><strong>The reason for its discovery<\/strong><\/h2>\n<p align=\"justify\">Although Facebook has a clear and stringent policy against impersonation, this malpractice just does not seem to stop. Most importantly, impersonators wreck havoc on the dignity of women in general and particularly in some parts of the world. Profile impersonation causes severe cultural and societal emergencies in quite a few regions of the world.<\/p>\n<p align=\"justify\">Facebook aims to stop such ramifications, thus making the platform safer for women across the globe. And their efforts are not restricted to the boundaries of the companies. Rather, Facebook is collaborating with social activists and other organizations to develop effective strategies for increased security for female users.<\/p>\n<h2><strong>Discoveries on cards<\/strong><\/h2>\n<p align=\"justify\">Other than identifying impersonation, Facebook is also experimenting with two new security features. The first one is about reports against intimate non-consensual photos, and the second one happens to be a photo-checkup feature.<\/p>\n<p align=\"justify\">With the help of these features, users will have the liberty of reporting against inappropriate images. Moreover, both the features aimed at making the reporting experience compassionate for users.<\/p>\n<p align=\"justify\">Security seems to be of paramount significance for every user on social platforms. With Facebook’s latest feature, user safety will surely get strengthened on the platform.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Whether it is Facebook, Twitter or other social media platforms, you simply cannot deny the importance and need for robust security. Although these sites are experimenting, testing and introducing amazing features each new day, not all of them seem to have practical utility for users. However, its latest offering might prove to be highly beneficial [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":3839,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[18],"tags":[],"class_list":["post-3752","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-news"],"_links":{"self":[{"href":"\/blog\/wp-json\/wp\/v2\/posts\/3752"}],"collection":[{"href":"\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/comments?post=3752"}],"version-history":[{"count":0,"href":"\/blog\/wp-json\/wp\/v2\/posts\/3752\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/media\/3839"}],"wp:attachment":[{"href":"\/blog\/wp-json\/wp\/v2\/media?parent=3752"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/categories?post=3752"},{"taxonomy":"post_tag","embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/tags?post=3752"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}