{"id":4037,"date":"2016-08-10T11:49:29","date_gmt":"2016-08-10T11:49:29","guid":{"rendered":"\/blog\/?p=4037"},"modified":"2020-10-26T06:35:59","modified_gmt":"2020-10-26T06:35:59","slug":"augment-reality-walk-blend-real-world-virtual-world","status":"publish","type":"post","link":"\/blog\/augment-reality-walk-blend-real-world-virtual-world\/","title":{"rendered":"Augment Reality (A Walk Through) – The Blend of Real World and Virtual World"},"content":{"rendered":"<p style=\"text-align: justify;\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-4029 size-full aligncenter\" src=\"https:\/\/ezranking.s3.eu-west-2.amazonaws.com\/ezrankings\/blog\/wp-content\/uploads\/2016\/08\/07115913\/augmented-reality.jpg\" alt=\"augmented-reality\" width=\"800\" height=\"400\" srcset=\"https:\/\/ezranking.s3.eu-west-2.amazonaws.com\/ezrankings\/blog\/wp-content\/uploads\/2016\/08\/07115913\/augmented-reality.jpg 800w, https:\/\/ezranking.s3.eu-west-2.amazonaws.com\/ezrankings\/blog\/wp-content\/uploads\/2016\/08\/07115913\/augmented-reality-300x150.jpg 300w, https:\/\/ezranking.s3.eu-west-2.amazonaws.com\/ezrankings\/blog\/wp-content\/uploads\/2016\/08\/07115913\/augmented-reality-768x384.jpg 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<p style=\"text-align: justify;\">As per Wikipedia – “<strong>Augmented reality (AR)<\/strong> is a live direct or indirect view of a physical, real-world environment whose elements are augmented (or supplemented) by computer-generated sensory input such as sound, video, graphics or GPS data.” The simple explanation to this is – Using Augmented Reality technology when the user views the natural world via. a medium such as a camera or lenses and the AR application embeds the virtual elements into this natural world making us feel that the virtual element is present in reality. This effect can be made more realistic with smart programming and push more virtual elements such as sound, representation or GPS information.<\/p>\n<p style=\"text-align: justify;\">All the major companies including <strong>Google, Apple and Microsoft<\/strong> are investing high on this technology and they have already developed their trademark software and hardware related to the same. Google has been working on Google Glass for past few fears and on the other hand, Microsoft is working on a project named as Holo Lens. Apple is also working on the same, but it is yet to announce its project name for augmenting reality. There are other major brands who have already developed an application that uses AR for rich and lively user experience. Time of India has its product named as Alive AR, Lenskart uses AR to show live online lenses look on user&#8217;s face and many other brands like Snapchat’s AR, LG robot vacuum, Acer, Ray-Ban, Volkswagen and Disneyland also have their AR based products in the market.<\/p>\n<p style=\"text-align: justify;\">Augmented Reality is the technology that will change the world as we see now, there are many possibilities that are being worked out each day by the software engineers around the world. Some of the best available API’s \/ software to code the application are:<\/p>\n<ul style=\"text-align: justify;\">\n<li>Layar<\/li>\n<li>Qualcomm Vuforia<\/li>\n<li>Star Walk<\/li>\n<li>Wikitude<\/li>\n<li>Google Ingress<\/li>\n<li>Arbasketball\/kick Ball<\/li>\n<li>AR Invaders<\/li>\n<li>Toywheel Toy Car Rc<\/li>\n<li>Mybrana 3d<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">This is just the beginning of a new era where <a href=\"\/blog\/can-virtual-reality-vr-live-up-to-the-hype\/\">virtual reality<\/a> gets amalgamated with our real world and offering us complete new dimension to view the world. Also, Augmented Reality will be amongst the most revolutionary technology in the market with great revenue opportunity for entrepreneurs. According to Juniper Research, augmented reality in marketing across mobile applications will generate 1.4 billion downloads by 2015, as an increasing number of brands familiarize themselves with the technology and its possibilities.<\/p>\n<p style=\"text-align: justify;\">To conclude I would say, that with possibilities to carve new niche in almost all the domains like Literature, Archaeology, Architecture, Visual art, Greeting cards, Commerce, Construction, Education,Emergency management \/ search and rescue, Video games, Industrial design, Medical, Beauty, Spatial immersion and interaction, Military, Navigation,Office workplace, Sports and entertainment, Task support, Television, Tourism and sightseeing, Translation etc. <strong>Augmented Reality<\/strong> will change every individual’s day to day life. Additionally, this will also create new ways of communication and business opportunity across the globe.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As per Wikipedia – “Augmented reality (AR) is a live direct or indirect view of a physical, real-world environment whose elements are augmented (or supplemented) by computer-generated sensory input such as sound, video, graphics or GPS data.” The simple explanation to this is – Using Augmented Reality technology when the user views the natural world [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":4029,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[16],"tags":[],"class_list":["post-4037","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-technology"],"_links":{"self":[{"href":"\/blog\/wp-json\/wp\/v2\/posts\/4037"}],"collection":[{"href":"\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/comments?post=4037"}],"version-history":[{"count":0,"href":"\/blog\/wp-json\/wp\/v2\/posts\/4037\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/media\/4029"}],"wp:attachment":[{"href":"\/blog\/wp-json\/wp\/v2\/media?parent=4037"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/categories?post=4037"},{"taxonomy":"post_tag","embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/tags?post=4037"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}