{"id":4066,"date":"2016-08-29T12:42:21","date_gmt":"2016-08-29T12:42:21","guid":{"rendered":"\/blog\/?p=4066"},"modified":"2021-03-03T10:56:23","modified_gmt":"2021-03-03T10:56:23","slug":"google-new-os-fuchsia","status":"publish","type":"post","link":"\/blog\/google-new-os-fuchsia\/","title":{"rendered":"Google is Working on a New OS Called Fuchsia"},"content":{"rendered":"<p style=\"text-align: justify;\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-4067 size-medium alignleft\" src=\"https:\/\/ezranking.s3.eu-west-2.amazonaws.com\/ezrankings\/blog\/wp-content\/uploads\/2016\/08\/07115928\/Fuchsia-e1522230793473.jpg\" alt=\"Fuchsia\" width=\"300\" height=\"170\" srcset=\"https:\/\/ezranking.s3.eu-west-2.amazonaws.com\/ezrankings\/blog\/wp-content\/uploads\/2016\/08\/07115928\/Fuchsia-e1522230793473.jpg 600w, https:\/\/ezranking.s3.eu-west-2.amazonaws.com\/ezrankings\/blog\/wp-content\/uploads\/2016\/08\/07115928\/Fuchsia-e1522230793473-300x170.jpg 300w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/p>\n<p style=\"text-align: justify;\">Google; the very name can create some many images in our mind. We cannot even think our life right now without this. Nonetheless, a decade ago Google was playing the role of a search engine and an advertiser. Till not Google is same, but some new role is added to it. Now it becomes the driving force that works behind the biggest computing platform of the recent time – Android. After working with the Chrome OS for a long time, now Google is up to something else. Recently it has been noticed that Google is working on a new OS or operating system which is known as Fuchsia. The best thing about this new OS that attracts you most is you can run it on almost anything.<\/p>\n<p style=\"text-align: justify;\"><strong>Taking the place of The Older Platforms<\/strong><\/p>\n<p style=\"text-align: justify;\">Linux is so far the most used open source operating system, and not only Google but also many companies prefer to use the same for plenty of reasons. Since it is open source, thus it is easily available from the GPL license. Apart from that, Linux can offer you a huge list of features that can help you to perform well. Coming back to the features of Fuchsia, it is based on a new and different kernel which is known as Magenta. This is a microkernel, and it builds on a distinct project known as LittleKernel. Fuchsia is a mixture of Pink and Purple.<\/p>\n<p style=\"text-align: justify;\">You can be familiar with the use of Magenta as the vital part of an embedded system that was common in set-top boxes as well as routers. Though Magenta is itself a lightweight platform but its power can be optimized to match with more powerful systems. The official page of Google Fuchsia makes it clear that the main aim of this project is working for “modern phones and modern personal computers”. This is to target those devices that have a huge RAM and faster processors.<\/p>\n<p style=\"text-align: justify;\"><strong>The Freedom Of Creation<\/strong><\/p>\n<p style=\"text-align: justify;\">When you get the chance to make something from the scratch, then you can get something that you truly desire or require the most. You know what type of features you would like to add to the same and can prepare every single aspect according to that. This time, it happens with Google.<\/p>\n<p style=\"text-align: justify;\">Linux has been ruling the market since last 25 years. It is used in almost all the possible manners for different types of applications. Repeated use makes it a little bit ungainly right now, and that is reason may be Google wish to work on this new OS. They are working with Fuchsia on a wide range of devices to find out how efficiently it can work. They have tried it on Acer laptop as well as Intel NUCs to find out the robustness of its functionalities.<\/p>\n<p style=\"text-align: justify;\">To make it more convenient for future usage, Google is presently applying a new system for the interface which is known as Flutter. The new programming language for this application is known as Dart.<\/p>\n<p style=\"text-align: justify;\"><strong>What To Do With Fuchsia<\/strong><\/p>\n<p style=\"text-align: justify;\">Some people think that Google will make it the next step of Android and Chrome. However, the main idea behind working on this is not clear till date.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Google; the very name can create some many images in our mind. We cannot even think our life right now without this. Nonetheless, a decade ago Google was playing the role of a search engine and an advertiser. Till not Google is same, but some new role is added to it. Now it becomes the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":4067,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[16],"tags":[],"class_list":["post-4066","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-technology"],"_links":{"self":[{"href":"\/blog\/wp-json\/wp\/v2\/posts\/4066"}],"collection":[{"href":"\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/comments?post=4066"}],"version-history":[{"count":0,"href":"\/blog\/wp-json\/wp\/v2\/posts\/4066\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/media\/4067"}],"wp:attachment":[{"href":"\/blog\/wp-json\/wp\/v2\/media?parent=4066"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/categories?post=4066"},{"taxonomy":"post_tag","embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/tags?post=4066"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}