{"id":4071,"date":"2016-08-30T04:47:48","date_gmt":"2016-08-30T04:47:48","guid":{"rendered":"\/blog\/?p=4071"},"modified":"2021-03-09T09:25:03","modified_gmt":"2021-03-09T09:25:03","slug":"twitter-announces-new-message-button","status":"publish","type":"post","link":"\/blog\/twitter-announces-new-message-button\/","title":{"rendered":"Twitter Announces New Message Button"},"content":{"rendered":"<p style=\"text-align: justify;\"><img loading=\"lazy\" decoding=\"async\" class=\"size-full wp-image-4075 aligncenter\" src=\"https:\/\/ezranking.s3.eu-west-2.amazonaws.com\/blog\/wp-content\/uploads\/2016\/08\/09092433\/Twitter-1.jpg\" alt=\"Twitter\" width=\"1200\" height=\"628\" \/><\/p>\n<p style=\"text-align: justify;\">The use of Twitter or other social media platforms for the promotion of business is a common factor nowadays. Enterprises; irrespective of their size and pattern like to use these units to share the information related to their business with their clients. That is the reason these platforms also try to become more and more prepared for such kind of activities. As a result of that, recently Twitter has announced the <a href=\"https:\/\/www.searchenginejournal.com\/twitter-message-button\/171631\/\" rel=\"nofollow\" target=\"_blank\">introduction of a new embeddable button<\/a> for the companies that they can use on their website through which the visitors can send them a direct message.<\/p>\n<p style=\"text-align: justify;\"><strong>The benefit of This Button<\/strong><\/p>\n<ul style=\"text-align: justify;\">\n<li><strong>Save your time:<\/strong> You do not need to visit the individual profile of that particular company on Twitter. You can send the message without look up the handle on the social network as well.<\/li>\n<li><strong>Less complicated process:<\/strong> Just click the button and send the message via Twitter; the process is much easier and simpler than before.<\/li>\n<\/ul>\n<p style=\"text-align: justify;\"><strong>From The Point Of View of the Companies<\/strong><\/p>\n<p style=\"text-align: justify;\">As a company owner, you should always try to build a stronger and easier way of communication with your clients so that you can know what they are expecting or maybe not expecting from you. Twitter now makes it easier for your business. You can provide your clients with another channel for faster and reliable customer support.<\/p>\n<p style=\"text-align: justify;\">The clients can feel it easier to communicate with the service provider whenever they need to share something related to the service or the products. The bond between these two entities will become stronger than before.<\/p>\n<p style=\"text-align: justify;\"><strong>For The Public Figures<\/strong><\/p>\n<p style=\"text-align: justify;\">Apart from the big or small enterprises, there are lots of public figures or celebrities who have websites and wish to communicate with their fans through the same. This new button of Twitter let their fans send private messages to them without much trouble.<\/p>\n<p style=\"text-align: justify;\">They can visit the website, click the button and send the message. However, before that they must follow certain steps:-<\/p>\n<ul style=\"text-align: justify;\">\n<li>You can find the new Message Button under the options of Twitter Button on the official page of this social network.<\/li>\n<li>You have to add your handle as well as the numerical user ID. You can get this ID from your settings.<\/li>\n<li>Now, you need to copy the auto-generated code and then paste it into your website.<\/li>\n<li>There is an option which you can get from Security and Privacy Setting section of your account. You need to “set” Twitter so that it can allow your website to receive those Direct Messages or DMs.<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">The button has some customizable features too. You can choose the language of the Button label. Make sure that the language you choose can be understood by your clients or fans if you wish to receive messages from all across the globe. You can also add some text that can pre-fill the box when someone wishes to message you through the same.<\/p>\n<p style=\"text-align: justify;\">Thus, this is a great opportunity for the business owners as well as the celebrities to come closer to their buyers and fans and allow them to send Direct Messages easily.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The use of Twitter or other social media platforms for the promotion of business is a common factor nowadays. Enterprises; irrespective of their size and pattern like to use these units to share the information related to their business with their clients. That is the reason these platforms also try to become more and more [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":11746,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[3],"tags":[],"class_list":["post-4071","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-smo"],"_links":{"self":[{"href":"\/blog\/wp-json\/wp\/v2\/posts\/4071"}],"collection":[{"href":"\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/comments?post=4071"}],"version-history":[{"count":0,"href":"\/blog\/wp-json\/wp\/v2\/posts\/4071\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/media\/11746"}],"wp:attachment":[{"href":"\/blog\/wp-json\/wp\/v2\/media?parent=4071"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/categories?post=4071"},{"taxonomy":"post_tag","embeddable":true,"href":"\/blog\/wp-json\/wp\/v2\/tags?post=4071"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}